MikroElektronika/core_packages/PIC/XC8/def/PIC16LF15375/mcu.h
extern volatile PCON1bits_t PCON1bits __at(0x814);
// bitfield macros
#define _PCON1_nMEMV_POSN                                   0x1
#define _PCON1_nMEMV_POSITION                               0x1
#define _PCON1_nMEMV_SIZE                                   0x1
#define _PCON1_nMEMV_LENGTH                                 0x1
#define _PCON1_nMEMV_MASK                                   0x2

// Register: NVMADR
#define NVMADR NVMADR
extern volatile unsigned short          NVMADR              __at(0x81A);
#ifndef _LIB_BUILD
asm("NVMADR equ 081Ah");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x81A);
#ifndef _LIB_BUILD
asm("NVMADRL equ 081Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRL0               :1;
        unsigned NVMADRL1               :1;
        unsigned NVMADRL2               :1;
        unsigned NVMADRL3               :1;
        unsigned NVMADRL4               :1;
        unsigned NVMADRL5               :1;
        unsigned NVMADRL6               :1;
        unsigned NVMADRL7               :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x81A);
// bitfield macros
#define _NVMADRL_NVMADRL0_POSN                              0x0
#define _NVMADRL_NVMADRL0_POSITION                          0x0
#define _NVMADRL_NVMADRL0_SIZE                              0x1
#define _NVMADRL_NVMADRL0_LENGTH                            0x1
#define _NVMADRL_NVMADRL0_MASK                              0x1
#define _NVMADRL_NVMADRL1_POSN                              0x1
#define _NVMADRL_NVMADRL1_POSITION                          0x1
#define _NVMADRL_NVMADRL1_SIZE                              0x1
#define _NVMADRL_NVMADRL1_LENGTH                            0x1
#define _NVMADRL_NVMADRL1_MASK                              0x2
#define _NVMADRL_NVMADRL2_POSN                              0x2
#define _NVMADRL_NVMADRL2_POSITION                          0x2
#define _NVMADRL_NVMADRL2_SIZE                              0x1
#define _NVMADRL_NVMADRL2_LENGTH                            0x1
#define _NVMADRL_NVMADRL2_MASK                              0x4
#define _NVMADRL_NVMADRL3_POSN                              0x3
#define _NVMADRL_NVMADRL3_POSITION                          0x3
#define _NVMADRL_NVMADRL3_SIZE                              0x1
#define _NVMADRL_NVMADRL3_LENGTH                            0x1
#define _NVMADRL_NVMADRL3_MASK                              0x8
#define _NVMADRL_NVMADRL4_POSN                              0x4
#define _NVMADRL_NVMADRL4_POSITION                          0x4
#define _NVMADRL_NVMADRL4_SIZE                              0x1
#define _NVMADRL_NVMADRL4_LENGTH                            0x1
#define _NVMADRL_NVMADRL4_MASK                              0x10
#define _NVMADRL_NVMADRL5_POSN                              0x5
#define _NVMADRL_NVMADRL5_POSITION                          0x5
#define _NVMADRL_NVMADRL5_SIZE                              0x1
#define _NVMADRL_NVMADRL5_LENGTH                            0x1
#define _NVMADRL_NVMADRL5_MASK                              0x20
#define _NVMADRL_NVMADRL6_POSN                              0x6
#define _NVMADRL_NVMADRL6_POSITION                          0x6
#define _NVMADRL_NVMADRL6_SIZE                              0x1
#define _NVMADRL_NVMADRL6_LENGTH                            0x1
#define _NVMADRL_NVMADRL6_MASK                              0x40
#define _NVMADRL_NVMADRL7_POSN                              0x7
#define _NVMADRL_NVMADRL7_POSITION                          0x7
#define _NVMADRL_NVMADRL7_SIZE                              0x1
#define _NVMADRL_NVMADRL7_LENGTH                            0x1
#define _NVMADRL_NVMADRL7_MASK                              0x80

// Register: NVMADRH
#define NVMADRH NVMADRH
extern volatile unsigned char           NVMADRH             __at(0x81B);
#ifndef _LIB_BUILD
asm("NVMADRH equ 081Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRH0               :1;
        unsigned NVMADRH1               :1;
        unsigned NVMADRH2               :1;
        unsigned NVMADRH3               :1;
        unsigned NVMADRH4               :1;
        unsigned NVMADRH5               :1;
        unsigned NVMADRH6               :1;
    };
} NVMADRHbits_t;
extern volatile NVMADRHbits_t NVMADRHbits __at(0x81B);
// bitfield macros
#define _NVMADRH_NVMADRH0_POSN                              0x0
#define _NVMADRH_NVMADRH0_POSITION                          0x0
#define _NVMADRH_NVMADRH0_SIZE                              0x1
#define _NVMADRH_NVMADRH0_LENGTH                            0x1
#define _NVMADRH_NVMADRH0_MASK                              0x1
#define _NVMADRH_NVMADRH1_POSN                              0x1
#define _NVMADRH_NVMADRH1_POSITION                          0x1
#define _NVMADRH_NVMADRH1_SIZE                              0x1
#define _NVMADRH_NVMADRH1_LENGTH                            0x1
#define _NVMADRH_NVMADRH1_MASK                              0x2
#define _NVMADRH_NVMADRH2_POSN                              0x2
#define _NVMADRH_NVMADRH2_POSITION                          0x2
#define _NVMADRH_NVMADRH2_SIZE                              0x1
#define _NVMADRH_NVMADRH2_LENGTH                            0x1
#define _NVMADRH_NVMADRH2_MASK                              0x4
#define _NVMADRH_NVMADRH3_POSN                              0x3
#define _NVMADRH_NVMADRH3_POSITION                          0x3
#define _NVMADRH_NVMADRH3_SIZE                              0x1
#define _NVMADRH_NVMADRH3_LENGTH                            0x1
#define _NVMADRH_NVMADRH3_MASK                              0x8
#define _NVMADRH_NVMADRH4_POSN                              0x4
#define _NVMADRH_NVMADRH4_POSITION                          0x4
#define _NVMADRH_NVMADRH4_SIZE                              0x1
#define _NVMADRH_NVMADRH4_LENGTH                            0x1
#define _NVMADRH_NVMADRH4_MASK                              0x10
#define _NVMADRH_NVMADRH5_POSN                              0x5
#define _NVMADRH_NVMADRH5_POSITION                          0x5
#define _NVMADRH_NVMADRH5_SIZE                              0x1
#define _NVMADRH_NVMADRH5_LENGTH                            0x1
#define _NVMADRH_NVMADRH5_MASK                              0x20
#define _NVMADRH_NVMADRH6_POSN                              0x6
#define _NVMADRH_NVMADRH6_POSITION                          0x6
#define _NVMADRH_NVMADRH6_SIZE                              0x1
#define _NVMADRH_NVMADRH6_LENGTH                            0x1
#define _NVMADRH_NVMADRH6_MASK                              0x40

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned short          NVMDAT              __at(0x81C);
#ifndef _LIB_BUILD
asm("NVMDAT equ 081Ch");
#endif

// Register: NVMDATL
#define NVMDATL NVMDATL
extern volatile unsigned char           NVMDATL             __at(0x81C);
#ifndef _LIB_BUILD
asm("NVMDATL equ 081Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATL0               :1;
        unsigned NVMDATL1               :1;
        unsigned NVMDATL2               :1;
        unsigned NVMDATL3               :1;
        unsigned NVMDATL4               :1;
        unsigned NVMDATL5               :1;
        unsigned NVMDATL6               :1;
        unsigned NVMDATL7               :1;
    };
} NVMDATLbits_t;
extern volatile NVMDATLbits_t NVMDATLbits __at(0x81C);
// bitfield macros
#define _NVMDATL_NVMDATL0_POSN                              0x0
#define _NVMDATL_NVMDATL0_POSITION                          0x0
#define _NVMDATL_NVMDATL0_SIZE                              0x1
#define _NVMDATL_NVMDATL0_LENGTH                            0x1
#define _NVMDATL_NVMDATL0_MASK                              0x1
#define _NVMDATL_NVMDATL1_POSN                              0x1
#define _NVMDATL_NVMDATL1_POSITION                          0x1
#define _NVMDATL_NVMDATL1_SIZE                              0x1
#define _NVMDATL_NVMDATL1_LENGTH                            0x1
#define _NVMDATL_NVMDATL1_MASK                              0x2
#define _NVMDATL_NVMDATL2_POSN                              0x2
#define _NVMDATL_NVMDATL2_POSITION                          0x2
#define _NVMDATL_NVMDATL2_SIZE                              0x1
#define _NVMDATL_NVMDATL2_LENGTH                            0x1
#define _NVMDATL_NVMDATL2_MASK                              0x4
#define _NVMDATL_NVMDATL3_POSN                              0x3
#define _NVMDATL_NVMDATL3_POSITION                          0x3
#define _NVMDATL_NVMDATL3_SIZE                              0x1
#define _NVMDATL_NVMDATL3_LENGTH                            0x1
#define _NVMDATL_NVMDATL3_MASK                              0x8
#define _NVMDATL_NVMDATL4_POSN                              0x4
#define _NVMDATL_NVMDATL4_POSITION                          0x4
#define _NVMDATL_NVMDATL4_SIZE                              0x1
#define _NVMDATL_NVMDATL4_LENGTH                            0x1
#define _NVMDATL_NVMDATL4_MASK                              0x10
#define _NVMDATL_NVMDATL5_POSN                              0x5
#define _NVMDATL_NVMDATL5_POSITION                          0x5
#define _NVMDATL_NVMDATL5_SIZE                              0x1
#define _NVMDATL_NVMDATL5_LENGTH                            0x1
#define _NVMDATL_NVMDATL5_MASK                              0x20
#define _NVMDATL_NVMDATL6_POSN                              0x6
#define _NVMDATL_NVMDATL6_POSITION                          0x6
#define _NVMDATL_NVMDATL6_SIZE                              0x1
#define _NVMDATL_NVMDATL6_LENGTH                            0x1
#define _NVMDATL_NVMDATL6_MASK                              0x40
#define _NVMDATL_NVMDATL7_POSN                              0x7
#define _NVMDATL_NVMDATL7_POSITION                          0x7
#define _NVMDATL_NVMDATL7_SIZE                              0x1
#define _NVMDATL_NVMDATL7_LENGTH                            0x1
#define _NVMDATL_NVMDATL7_MASK                              0x80

// Register: NVMDATH
#define NVMDATH NVMDATH
extern volatile unsigned char           NVMDATH             __at(0x81D);
#ifndef _LIB_BUILD
asm("NVMDATH equ 081Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATH0               :1;
        unsigned NVMDATH1               :1;
        unsigned NVMDATH2               :1;
        unsigned NVMDATH3               :1;
        unsigned NVMDATH4               :1;
        unsigned NVMDATH5               :1;
    };
} NVMDATHbits_t;
